## estadistica

Pandas provee numerosos métodos para realizar estadísticas
sobre los datos tanto en series como en dataframes. Por defecto,
estos métodos ignoran los missing values, no teniéndolos en
cuenta a la hora de realizar los cálculos. Si se usa el parámetro
skipna = False los valores NaN se propagan al resultado final.

In [2]:
import pandas as pd
import numpy as np

In [3]:
ruta = r'C:\Users\balti\Desktop\Programacion\PYTHON\CURSOS\Analisis-de-datos\teoria\modulo 4\csv\titanic.csv'
data = pd.read_csv(ruta)
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# promedio y desviacion
data['Age'].mean(), data['Age'].std()

(np.float64(29.69911764705882), 14.526497332334044)

In [12]:
#promedio de edad delos pasajero de primera clase
data.loc[data['Pclass']==1,'Age'].mean()

np.float64(38.233440860215055)

In [17]:
#promedio de edad de las mujeres de primera clase
data.loc[(data['Sex']=='female') & (data['Pclass']==1),'Age'].mean()

np.float64(34.61176470588235)

In [22]:
# contar cantidad de varones
data.loc[data['Sex']=='male','Sex'].count()

np.int64(577)

In [26]:
data["Age"].min(), data["Age"].max()

(0.42, 80.0)

In [27]:
# cantidad de leemntos unicos en cada columna
data.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

## describe()
permite vber un resumen de las principales estadisticas de cada columna

si es numerica devuleva: cantidad de elemetos validos, promedio, desviacion standar, minimo maximo y cuartiles

si es __no numerica__ : cantidad de elementos válidos, cantidad de elementos únicos y el elemento más frecuente y su frecuencia.

cuando son alpahnumericas : sólo muestra el resumen de las columnas numéricas

In [32]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## aggregate()

este metodo con alias agg permite hacer un resumen con las funciones de agregacion que querramos, se le puede pasar como argumnetos un string con el nombre de la funcion o la funcion en si

In [6]:
data.select_dtypes('number').aggregate(['sum','min',np.max,'var'])

C:\Users\balti\AppData\Local\Temp\ipykernel_26760\427067315.py:1: FutureWarning: The provided callable <function max at 0x00000193734DB560> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  data.select_dtypes('number').aggregate(['sum','min',np.max,'var'])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
sum,397386.0,342.000000,2057.000000,21205.170000,466.000000,340.000000,28693.949300
min,1.0,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
max,891.0,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200
var,66231.0,0.236772,0.699015,211.019125,1.216043,0.649728,2469.436846

## value_counts()
El método value_counts para series permite encontrar
una distribución de frecuencias de los valores únicos que
contiene. Devuelve una serie cuyos índices son los valores
únicos de la serie original y sus valores son las respectivas
frecuencias.
El resultado está ordenado de mayor a menor, de modo
que el primer elemento es el más frecuente.
Se puede hacer que se ordene en orden ascendente con
el parámetro ascending.
El parámetro normalize permite obtener las proporciones
de cada valor.